'use strict';
{
    const cList=[
    "c20221208",
    "c20221213",
    "c20221215",
    "c20221216",
    "c20221219",
    "c20221220",
    "c20221221",
    "c20221223",
    "c20221229",
    "c20230104",
    "c20230109",
    "c20230110",
    "c20230116",
    "c20230119",
    "c20230127",
    "c20230211",
    "c20230213",
    "c20230218"];
    const mList=[
        "20221208",
        "20221213",
        "20221215",
        "20221216",
        "20221219",
        "20221220",
        "20221221",
        "20221223",
        "20221229",
        "20230104",
        "20230109",
        "20230110",
        "20230116",
        "20230119",
        "20230127",
        "20230211",
        "20230213",
        "20230218"];

    for(let i=0;i<=cList.length;i++){
        const c=document.getElementById(cList[i]);
        const m=document.getElementById(mList[i]);
        c.addEventListener('click',function(){
            m.classList.remove('d-none');
        });
    }
} // main.js 全体の閉じタグ